Documents/ESB/ESB_Consumer_0712/003TestSample/SAMPLE_XML_MUST/DebitCard/DC06_DbCardLockDtlsInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DebitCard/DbCardLockDtlsInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardLockDtlsInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardLockDtlsInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC06</v11:TxnId>  
        <v11:TxnNo>DC0600001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:InqPageNo>1</v11:InqPageNo>  
        <v11:NoOfPage>10</v11:NoOfPage>  
        <v11:CardNo>5211958800000591</v11:CardNo>  
        <v11:StartCfgDate>20170101</v11:StartCfgDate>  
        <v11:EndCfgDate>20180131</v11:EndCfgDate> 
      </v11:ServiceBody> 
    </v11:DbCardLockDtlsInqRq> 
  </soap:Body> 
</soap:Envelope>
